<template>
  <div>
    <p>
      1. 개인정보 수집에 대한 동의
       이용자가 개인정보처리방침 또는 이용약관의 내용에 동의 여부를 선택할 수 있는 절차를 마련하고 있으며, 동의를 선택하면 개인정보 수집에 동의한 것으로 봅니다.
    </p>
    
    <p>
      2. 개인정보 수집 및 이용 목적
      회사는 회원관리, 서비스 제공 등 다음의 목적을 위하여 개인정보를 수집하고 이용합니다. 수집한 정보는 이용자에게 미리 공개한 목적 이외의 다른 목적으로는 사용하지 않으며, 외부로 유출하지 않습니다. 이용 목적이 변경되는 경우에는 변경사항을 알리고 별도의 동의를 받는 등 필요한 조치를 이행하도록 하겠습니다.

      가. 회원 가입 의사의 확인, 연령 확인, 이용자 본인 확인, 이용자 식별, 회원탈퇴 의사의 확인 등 회원관리를 위하여 개인정보를 이용합니다.

      나. 회사의 디지털 콘텐츠 등 서비스 제공, 기존 서비스 개선 등을 위하여 개인정보를 이용합니다.

      다. 법령 및 회사 이용약관을 위반하는 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재, 계정 도용 및 부정거래 방지, 약관 개정 등의 고지사항 전달, 분쟁 조정을 위한 기록 보존, 민원처리 등 이용자 보호 및 서비스 운영을 위하여 개인정보를 이용합니다.

      라. 서비스 이용기록과 접속 빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤 서비스 제공 등에 개인정보를 이용합니다.
    </p>
    <p>
      3. 개인정보의 처리 및 보유기간
      회사는 법령에 따른 개인정보 보유 및 이용기간 또는 이용자로부터 동의 받은 기간 내에서 개인정보를 처리하고 보유합니다. 각각의 개인정보 처리 및 보유기간은 다음과 같습니다.

      가. 회원 가입 및 관리 : 회원 탈퇴 시까지. 다만, 다음의 사유에 해당하는 경우에는 해당 사유 종료 시까지 보유합니다.

      1) 관계 법령 위반에 따른 수사·조사 등이 진행중인 경우에는 해당 수사·조사 등이 종료 시까지

      2) 홈페이지 이용에 따른 채권·채무관계 잔존시에는 해당 채권·채무관계 정산시까지

      나. 재화 또는 서비스 제공 : 재화·서비스 공급완료 및 요금 결제·정산 완료시까지. 다만, 다음의 사유에 해당하는 경우에는 해당 기간 종료시까지 보유합니다.

      1) 전자상거래 등에서의 소비자 보호에 관한 법률

      가) 표시·광고에 관한 기록 : 6개월

      나) 계약 또는 청약철회, 대금결제, 재화 등의 공급기록 : 5년

      다) 소비자 불만 또는 분쟁처리에 관한 기록 : 3년

      2) 통신비밀보호법

      - 컴퓨터 통신, 인터넷 로그 기록 자료, 접속지 추적자료 : 3개월

      다. 부정 이용 방지를 위한 부정 이용 기록 : 1년 보관

      라. 회사는 1년 동안 회사의 서비스를 이용하지 않은 이용자의 개인정보를 파기하거나 별도로 분리하여 보관합니다. 단, 전자상거래 등에서의 소비자보호에 관한 법률, 통신비밀보호법 등 관계 법령의 규정에 의하여 보존할 필요가 있는 경우 관계 법령에서 규정한 일정 기간동안 이용자 개인정보를 보관합니다. 이용자에게는 기간 만료 30일전까지 서비스 미사용으로 인한 개인정보 파기 또는 분리 보관 관련한 사항을 안내하도록 하겠습니다.
    </p>
    <p>
      4. 개인정보의 제3자 제공에 관한 사항
      회사는 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 다음의 경우에는 예외로 제공할 수 있습니다.

      가. 이용자의 사전 동의를 얻은 경우

      나. 법률의 규정에 의거하거나, 수사목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우
    </p>
    <p>
      5. 이용자와 법정대리인의 권리·의무 및 행사방법
      가. 이용자 및 법정대리인은 언제든지 로그인하여 등록된 개인정보를 조회하거나 수정할 수 있습니다. 또한 “회원탈퇴” 등을 통해 개인정보의 수집 및 이용 동의를 철회할 수 있습니다.

      나. 비회원 이용자의 경우는 소정의 본인 확인 절차를 거쳐 외사에 개인정보 수정, 삭제 등을 요청할 수 있습니다.

      다. 회사는 이용자 및 법정대리인이 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 해당 개인정보를 이용하거나 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정청 처리결과를 제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.
    </p>
    <p>
      6. 개인정보 파기에 관한 사항
      회사는 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 정보를 파기합니다.

      이용자로부터 동의 받은 개인정보 보유기간이 경과하거나 처리 목적이 달성되었음에도 불구하고 내부 방침 및 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보관합니다.

      가. 파기절차

      이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 지체 없이 파기합니다. 다만, 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 일정 기간 보관이 필요한 경우 별도의 DB(서면의 경우 별도의 서류함)로 옮겨져 일정기간 보관 후 파기합니다. 별도로 옮겨진 개인정보는 법률에 의한 경우 외에 다른 목적으로 이용하지 않습니다.

      나. 파기방법

      1) 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.

      2) 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 파기합니다.
    </p>
    <p>
      7. 개인정보의 안전성 확보조치에 관한 사항
      회사는 이용자의 개인정보를 안전하게 관리하기 위하여 최선을 다하고 있으며, 개인정보보호법 등 관련 법에 따라 개인정보를 안전하게 보호하고 있습니다.

      가. 이용자의 개인정보는 비밀번호에 의해 보호되며 파일 및 전송 데이터를 암호화하거나 파일 잠금 기능을 사용하여 중요한 데이터는 별도의 보안 기능을 통해 보호하고 있습니다.

      나. 회사는 백신프로그램을 이용하여 컴퓨터 바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다.

      다. 회사는 암호 알고리즘을 이용하여 네트워크 상의 개인정보를 안전하게 전송할 수 있는 보안장치를 채택하고 있습니다.

      라. 해킹 등 외부침입에 대비하여 침입차단 시스템 등을 이용하여 보안에 만전을 기하고 있습니다.

      마. 회사는 이용자의 개인정보에 대한 접근권한을 최소한의 인원으로 제한하고 있으며, 개인정보를 처리하는 직원을 대상으로 새로운 보안기술 습득 및 개인정보보호 의무 등에 관한 정기적인 사내 교육 및 외부 위탁 교육을 실시하고 있습니다.

      바. 전산실 등을 특별 보호구역으로 설정하여 출입을 통제하고 있습니다.

      ※ 회사는 이용자 본인의 부주의로 인한 아이디, 비밀번호 등의 개인정보가 유출되어 발생하는 문제에 대해서는 책임을 지지 않습니다.
    </p>
    <p>
      8. 개인정보 자동 수집 장치의 설치·운영 및 그 거부에 관한 사항
    가. 회사는 이용자의 편의와 시스템 운영을 위하여 ‘쿠키(cookie)’를 사용합니다. 쿠키는 웹사이트가 이용자의 컴퓨터 웹 브라우저로 전송하는 소량의 정보로, 이용자의 컴퓨터 하드디스크에 저장되며 이용자의 컴퓨터는 식별하지만 이용자를 개인적으로 식별하지 않습니다.

    나. 이용자는 쿠키에 대한 선택권이 있습니다. 웹 브라우저의 설정 또는 옵션 등의 메뉴를 통해 모든 쿠키를 허용 또는 거부하거나, 저장될 때마다 확인을 거치도록 할 수 있습니다. 다만, 이용자가 쿠키 설치를 거부하였을 경우에는 서비스 제공에 어려움이 있을 수 있습니다.
    </p>
  </div>
</template>

<script>
export default {

}
</script>

<style scoped lang="scss">
div {
  height: 350px;
  overflow: auto;
  border: 2px solid #ccc;
}
</style>